Revit 2027 API
AnalysisDisplayLegendSettings.Rounding Property
 Rounding increment for numeric values of analysis results.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Rounding { get; set; }
Public Property Rounding As Double
	Get
	Set
public:
property double Rounding {
	double get ();
	void set (double value);
}
member Rounding : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentsInconsistentException |  When setting this property: rounding is not positive
See Also
Reference
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace